; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v6 - type_3 ?v5 - type_1)
 	      (pred_3 ?v2 - object ?v5 - type_1)
	      (pred_4 ?v6 - type_3 ?v7 - type_2)
	      (pred_1 ?v6 - type_3 ?v2 - object ?v7 - type_2))

   (:action op_3
       :parameters  (?v6 - type_3 ?v8 ?v4 - type_1)
       :precondition (and  (pred_2 ?v6 ?v8))
       :effect (and  (pred_2 ?v6 ?v4)
		     (not (pred_2 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_3 ?v3 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v1) (pred_2 ?v6 ?v1) (pred_4 ?v6 ?v7))
       :effect (and (pred_1 ?v6 ?v3 ?v7)
		    (not (pred_3 ?v3 ?v1)) 
		    (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_3 ?v3 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v3 ?v7) (pred_2 ?v6 ?v1))
       :effect (and (pred_3 ?v3 ?v1)
		    (pred_4 ?v6 ?v7)
		    (not (pred_1 ?v6 ?v3 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_03 - type_3
obj_04 obj_05 obj_09 obj_08 - type_2
obj_06 obj_02 obj_13 obj_11 - type_1
obj_07 obj_12 obj_14 obj_10 - object)
(:init
(pred_2 obj_01 obj_02)
(pred_4 obj_01 obj_04)
(pred_4 obj_01 obj_05)
(pred_2 obj_03 obj_06)
(pred_4 obj_03 obj_09)
(pred_4 obj_03 obj_08)
(pred_3 obj_07 obj_06)
(pred_3 obj_12 obj_06)
(pred_3 obj_14 obj_02)
(pred_3 obj_10 obj_06)
)
(:goal
(and
(pred_3 obj_07 obj_13)
(pred_3 obj_12 obj_11)
(pred_3 obj_14 obj_02)
(pred_3 obj_10 obj_02)
)
)

(:constraints
  (always (not (pred_2 obj_01 obj_13)))
)
)

; plan
1. (op_1 obj_03 obj_07 obj_06 obj_08)
   deleted: (pred_3 obj_07 obj_06) (pred_4 obj_03 obj_08)
   added: (pred_1 obj_03 obj_07 obj_08)
   goals met: 1 of 4
2. (op_1 obj_03 obj_12 obj_06 obj_09)
   deleted: (pred_3 obj_12 obj_06) (pred_4 obj_03 obj_09)
   added: (pred_1 obj_03 obj_12 obj_09)
   goals met: 1 of 4
3. (op_3 obj_01 obj_02 obj_06)
   deleted: (pred_2 obj_01 obj_02)
   added: (pred_2 obj_01 obj_06)
   goals met: 1 of 4
4. (op_3 obj_03 obj_06 obj_11)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_11)
   goals met: 1 of 4
5. (op_1 obj_01 obj_10 obj_06 obj_05)
   deleted: (pred_3 obj_10 obj_06) (pred_4 obj_01 obj_05)
   added: (pred_1 obj_01 obj_10 obj_05)
   goals met: 1 of 4
6. (op_2 obj_03 obj_12 obj_11 obj_09)
   deleted: (pred_1 obj_03 obj_12 obj_09)
   added: (pred_3 obj_12 obj_11) (pred_4 obj_03 obj_09)
   goals met: 2 of 4
7. (op_3 obj_01 obj_06 obj_02)
   deleted: (pred_2 obj_01 obj_06)
   added: (pred_2 obj_01 obj_02)
   goals met: 2 of 4
8. (op_3 obj_03 obj_11 obj_13)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_13)
   goals met: 2 of 4
9. (op_2 obj_01 obj_10 obj_02 obj_05)
   deleted: (pred_1 obj_01 obj_10 obj_05)
   added: (pred_3 obj_10 obj_02) (pred_4 obj_01 obj_05)
   goals met: 3 of 4
10. (op_2 obj_03 obj_07 obj_13 obj_08)
   deleted: (pred_1 obj_03 obj_07 obj_08)
   added: (pred_3 obj_07 obj_13) (pred_4 obj_03 obj_08)
   goals met: 4 of 4
